{
  "basics": {
    "name": "Amgad Madkour",
    "label": "Principal Data Science Manager at Microsoft AI",
    "image": "",
    "url": "https://amgadmadkour.com",
    "summary": "My current work focuses on building large-scale data products that use various artificial intelligence techniques to deliver value to users.",
    "location": {
      "city": "Redmond",
      "countryCode": "US",
      "region": "Washington"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "amgadmadkour",
        "url": "https://twitter.com/amgadmadkour"
      }
    ]
  },
  "work": [
    {
      "name": "Microsoft",
      "position": "Principal Data Science Manager",
      "location": "Redmond, USA",
      "startDate": "2019-01-01",
      "highlights": [
        "Autos Marketplace: Technical lead for Automotive Q&A, My Garage, Autos Listings, and Autos AI features that deliver differentiating content to automotive users.",
        "Platform for Interactive Concept Learning: Maintained and enhanced the model used by Microsoft Edge for extracting product information form e-Commerce domains.",
        "Entity Matching: Enhanced the performance of the entity matching stack by addressing the highly skewed data issues, delta entity matching, and optimizing the blocking technique."
      ]
    },
    {
      "name": "Microsoft",
      "position": "Data Scientist Intern",
      "location": "Redmond, USA",
      "startDate": "2018-05-01",
      "endDate": "2018-08-01",
      "highlights": [
        "Conflation Updates: Designed and implemented a conflation update component that is responsible for speeding up the reflection of conflation changes into the Satori final graph."
      ]
    },
    {
      "name": "Microsoft Research",
      "position": "Research Intern",
      "location": "Redmond, USA",
      "startDate": "2015-05-01",
      "endDate": "2015-08-01",
      "highlights": [
        "Dependency parsing: Conducted a series of experiments ranging from Up-training to Entity Linking to improve the dependency parsing accuracy."
      ]
    },
    {
      "name": "Yahoo!",
      "position": "Research Intern",
      "location": "Sunnyvale, USA",
      "startDate": "2011-05-01",
      "endDate": "2011-08-01",
      "highlights": ["Recommendation system: Developed a recommendation system for local businesses."]
    },
    {
      "name": "IBM",
      "position": "Research Engineer",
      "location": "Cairo, Egypt",
      "startDate": "2006-01-01",
      "endDate": "2010-07-01",
      "highlights": [
        "Tag Recommendation Technique: Co-Invented and patented a k-partite graph technique for recommendation of tags during bookmarking of resources.",
        "Spam Detection: Proposed a set of features that identify spamming bookmarks in social media and evaluated their feasibility over various machine learning algorithms.",
        "Extracting relations from biomedical text: Developed a system that automatically extracts interactions between entities such as proteins, chemicals, and diseases from biomedical text with preliminary focus on protein-protein interactions.",
        "Machine Assisted Translation: Developed a system that provides suggestions when translating documents. The system uses a continuous space language models for statistical machine translation.",
        "Unstructured Information Management Platform: Participated in a joint development with Watson lab in Yorktown to develop a system that analyzes large volumes of unstructured textual information from the news domain to discover, organize, and deliver relevant knowledge to end-users."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Egypt Scholars",
      "location": "Cairo, Egypt",
      "position": "Volunteer",
      "url": "https://egyptscholars.org",
      "startDate": "2014-04-01",
      "endDate": "2015-07-01",
      "summary": "Developing software for the visually impaired"
    }
  ],
  "education": [
    {
      "institution": "Purdue University",
      "location": "West Lafayette, USA",
      "url": "https://www.cs.purdue.edu",
      "studyType": "PhD in Computer Science"
    }
  ],
  "awards": [
    {
      "title": "Award of Achievement",
      "date": "2006-11-01",
      "awarder": "IBM"
    }
  ],
  "languages": [
    {
      "language": "Arabic",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ]
}
