{"basics":{"name":"Amgad Madkour","label":"Principal Data Science Manager at Microsoft AI","image":"","url":"https://amgadmadkour.com","summary":"A seasoned technology leader with over +10 years of experience in transforming business strategies into scalable products. Expertise spans across Artificial Intelligence, Knowledge Graphs, Data Management, and Data Integration. Proven ability to deliver on highly ambiguous projects through incremental delivery, ensuring maximum business value. Experienced in leading multiple cross-functional engineering and science teams, overseeing program execution, and creating and tracking success metrics. Currently managing a team of 10 professionals, including Software Engineers and Applied Scientists, focused on building large-scale products that leverage various data management and artificial intelligence techniques to deliver significant value to users.","location":{"city":"Redmond","countryCode":"US","region":"Washington"}},"work":[{"name":"Microsoft","position":"Principal Data Science Manager","location":"Redmond, USA","startDate":"2024-11-01","highlights":["Led the engineering and science work for the product tracking platform on Microsoft Copilot and Edge.","Doubled the growth of product tracking through FY24, enhancing user shopping intent insights.","Introduced innovative features that extract user's shopping intent to enhance Shopping experience on Microsoft's platform."]},{"name":"Microsoft","position":"Senior Data Science Manager","location":"Redmond, USA","startDate":"2022-04-01","endDate":"2024-11-01","highlights":["Led the development of Microsoft Autos AI Assistant, the first assistant on an autos marketplace using generative models.","Spearheaded the creation of My Garage for Microsoft Autos Marketplace, consolidating user vehicle data from various sources.","Developed autos entity frameworks for Bing, MSN, and Microsoft Autos Marketplace."]},{"name":"Microsoft","position":"Data Scientist Intern","location":"Redmond, USA","startDate":"2018-05-01","endDate":"2018-08-01","highlights":["Conflation Updates: Designed and implemented a conflation update component that is responsible for speeding up the reflection of conflation changes into the Satori final graph."]},{"name":"Microsoft Research","position":"Research Intern","location":"Redmond, USA","startDate":"2015-05-01","endDate":"2015-08-01","highlights":["Dependency parsing: Conducted a series of experiments ranging from Up-training to Entity Linking to improve the dependency parsing accuracy."]},{"name":"Yahoo!","position":"Research Intern","location":"Sunnyvale, USA","startDate":"2011-05-01","endDate":"2011-08-01","highlights":["Recommendation system: Developed a recommendation system for local businesses."]},{"name":"IBM","position":"Research Engineer","location":"Cairo, Egypt","startDate":"2006-01-01","endDate":"2010-07-01","highlights":["Tag Recommendation Technique: Co-Invented and patented a k-partite graph technique for recommendation of tags during bookmarking of resources.","Spam Detection: Proposed a set of features that identify spamming bookmarks in social media and evaluated their feasibility over various machine learning algorithms.","Extracting relations from biomedical text: Developed a system that automatically extracts interactions between entities such as proteins, chemicals, and diseases from biomedical text with preliminary focus on protein-protein interactions.","Machine Assisted Translation: Developed a system that provides suggestions when translating documents. The system uses a continuous space language models for statistical machine translation.","Unstructured Information Management Platform: Participated in a joint development with Watson lab in Yorktown to develop a system that analyzes large volumes of unstructured textual information from the news domain to discover, organize, and deliver relevant knowledge to end-users."]}],"volunteer":[{"organization":"Egypt Scholars","location":"Cairo, Egypt","position":"Volunteer","url":"https://egyptscholars.org","startDate":"2014-04-01","endDate":"2015-07-01","summary":"Developing software for the visually impaired"}],"education":[{"institution":"Purdue University","location":"West Lafayette, USA","url":"https://www.cs.purdue.edu","studyType":"PhD in Computer Science"}],"awards":[{"title":"Award of Achievement","date":"2006-11-01","awarder":"IBM"}],"languages":[{"language":"Arabic","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""}]}